Revit 2024 API
StructuralElementDefinitionData Class
 Class containing information about section and position of the structural element.
Namespace: Autodesk.Revit.DB.Structure.StructuralSections
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class StructuralElementDefinitionData : IDisposable
Visual Basic
Public Class StructuralElementDefinitionData _
	Implements IDisposable
Visual C++
public ref class StructuralElementDefinitionData : IDisposable
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Structure.StructuralSections.StructuralElementDefinitionData
See Also
StructuralElementDefinitionData Members
Autodesk.Revit.DB.Structure.StructuralSections Namespace